Revit 2024 API
ParameterTypeId.StairsRailingTangentConnection Property
 "Tangent Joins"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsRailingTangentConnection { get; }
Visual Basic
Public Shared ReadOnly Property StairsRailingTangentConnection As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsRailingTangentConnection {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace